Repository: Diaz1401/CodeMap
Catalog: lib/l10n/app_*.arb
Languages: id

# codeInputTitle
source: Paste your code snippet below:
id: Tempelkan potongan kode dibawah:

# codeInputHint
source: Paste code here...
id: Tempelkan kode disini...

# codeInputButton
source: Analyze
id: Analisa

# systemPromptLang
source: English
id: Bahasa Indonesia

# resultErr
source: Failed to get AI result.
id: Gagal mendapatkan hasil AI.

# resultTabSummary
source: Summary
id: Ringkasan

# resultTabLineByLine
source: Line-by-Line
id: Baris demi Baris

# resultTabGlossary
source: Glossary
id: Glosarium

# resultTabLearningPath
source: Learning Path
id: Jalur Pembelajaran

# resultLoading
source: Loading...
id: Memuat...

# resultNoCode
source: No code analyzed yet.
id: Belum ada kode yang dianalisis.

# navbarInputCode
source: Input Code
id: Masukan Kode

# navbarResults
source: Result
id: Hasil

# navbarSetting
source: Setting
id: Pengaturan

# titleWelcome
source: Welcome to CodeMap
id: Selamat datang di CodeMap

# msgInputLimitReached
source: Account code input limit reached. Please try again 6 hours later.
id: Batas input kode akun telah tercapai. Silakan coba lagi dalam 6 jam.

# msgContinueWithGoogle
source: Please continue with Google account to use this app.
id: Silakan lanjutkan dengan akun Google untuk menggunakan aplikasi ini.

# btnContinueWithGoogle
source: Continue with Google
id: Lanjutkan dengan akun Google

# msgSignInFailed
source: Sign in failed. Please try again.
id: Gagal masuk. Silakan coba lagi.
